Documents/ВСД2_Производство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_Производство</Name>
			<Comment>api 2.*</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.кб_НезавершенныеПроизводственныеТранзакции</xr:Item>
				<xr:Item>AccumulationRegister.кб99_ОстаткиПартийВСД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cargoInspected</Name>
					<Comment>Отметка об обследовании партии продукции ветеринарным врачом.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыИсследований</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кб99_РезультатИсследования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>operationId</Name>
					<Comment>№ транзакции при НЗП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьОперацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершениеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Можно фасовку добавить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Comment>1 - приход,0 - расход</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПродукции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скоропортящийся</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Некачественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество1с</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УровниУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_Маркировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/кб_НезавершенныеПроизводственныеТранзакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кб_НезавершенныеПроизводственныеТранзакции</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранзакцияОткрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродукцияЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерОперацииНезавершенногоПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВСД2_Производство/Ext/ObjectModule.bsl
// GRACE:MODULE_START name="ПроизводствоВСД"
// @grace-module: ПроизводствоВСД
// @grace-purpose: Объектный модуль документа ВСД2_Производство — заполнение, обработка проведения, экспортные функции
// @grace-depends: ЯдроВСД, ДокументооборотВСД, ПроизводствоВСД, ИнтеграцияВетИС_API, РегистрыПартий
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ПроизводствоВСД"
// GRACE:DEPENDENCY target="кб99_ВСД"
// GRACE:DEPENDENCY target="ВетИС_УтилитыКлиентСервер"
// GRACE:DEPENDENCY target="ВетИС_ПроизводствоСервер"
// GRACE:DEPENDENCY target="ВетИС_ДокументооборотСервер"
// GRACE:DEPENDENCY target="ВетИС_ЗаполнениеДокументовСервер"

// @grace-contract: ВСД2_Производство_ЗаполнитьДатыИзготовления
//   Вход: стрПродукция (СтрокаТаблицыЗначений) — строка табличной части Продукция
//   Вход: ВыбДата (Дата) — выбранная дата производства
//   Выход: нет (изменяет строку in-place)
//   Исключение: нет
//   Инвариант: стрПродукция.Продукция_Элемент.СрокГодности должен быть заполнен
//   GRACE-лог: нет
// GRACE:CONTRACT function="ВСД2_Производство_ЗаполнитьДатыИзготовления"

Перем мНеОткрыватьФормуДокумента Экспорт;  //Запрешает открывать форму при вводе на основании, если уже введен ВСД
Перем ПараметрыОрганизации Экспорт;

Функция ВСД2_Производство_ЗаполнитьДатыИзготовления( стрПродукция, ВыбДата )  Экспорт
	
	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("ВСД2_Производство_ЗаполнитьДатыИзготовления");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ВСД2_Производство_ЗаполнитьДатыИзготовления( ПараметрыОрганизации, стрПродукция, ВыбДата );
	КонецЕсли;
	
	стрПродукция.ДатаИзготовления1 = ВыбДата;		
	стрПродукция.ДатаСрокГодности1 = стрПродукция.ДатаИзготовления1+60*60*24*стрПродукция.Продукция_Элемент.СрокГодности;		
		
КонецФункции 

Процедура ЗаполнитьПоРеализации( ДанныеЗаполнения )
	
	// Заполнение шапки
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	Дата =  ДанныеЗаполнения.Дата;
	
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );	
	
	Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] ) Тогда
		Сообщить("Сохраните параметры для Организации "+ДанныеЗаполнения.Организация);
		Возврат;
	КонецЕсли;			
	
	Если НЕ ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] Тогда		
		ДокВСД = ВетИС_ЯдроСервер.НайтиВСД_Производство(ДанныеЗаполнения.Ссылка);
		Если ЗначениеЗаполнено(ДокВСД) Тогда
			Сообщить("Уже создан "+ДокВСД);				
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПереопределяемыеПоляЗапроса = ВетИС_ДокументооборотСервер.ПолучитьПредставлениеПолейДокументаВЗапрос();
	Производитель_ХозСубъект = ПараметрыОрганизации["Отправитель_ХозСубъект"];//ВСД.НайтиХозСубъект(КонтрагентОрганизации);
	Попытка
		Производитель_Площадка = ВетИС_ЯдроСервер.НайтиПлощадкуПоСкладу(ДокументОснование[ПереопределяемыеПоляЗапроса.ПолеСклад], Производитель_ХозСубъект);
	Исключение			
	КонецПопытки;
	Если НЕ ЗначениеЗаполнено( Производитель_Площадка ) Тогда 
		Производитель_Площадка = ПараметрыОрганизации["Отправитель_Площадка"];
	КонецЕсли;
	ЗавершитьОперацию = true;
	cargoInspected = true;
	РезультатыИсследований = ПараметрыОрганизации["ВСД_РезультатыИсследований"];//Перечисления.ВСД_РезультатИсследования.VSEFULL;
	
	Если ПараметрыОрганизации["ПарамИспользоватьСерииПродукции"] Тогда 
		//заполняем по ТЧ СерииПродукции
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.СерииПродукции Цикл
			Продукция_Элемент = ВетИС_ЯдроСервер.Продукция_Элемент_ПолучитьПоНоменклатуре( ТекСтрокаТовары.Номенклатура, ДанныеЗаполнения.Контрагент );
			Если ПараметрыОрганизации["ПропускатьПустыеСвойства"] Тогда
				Если НЕ ЗначениеЗаполнено(Продукция_Элемент) Тогда
					Сообщить("Не указано соответствие для "+ТекСтрокаТовары.Номенклатура+" -> в параметрах указано Пропускать");
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока = Продукция.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Продукция_Элемент = Продукция_Элемент;//ВСД.Получить_ВСД_Продукция_Элемент( НоваяСтрока.Номенклатура );
			
			НоваяСтрока.Продукция = НоваяСтрока.Продукция_Элемент.Продукция ;
			НоваяСтрока.ВидПродукции =  НоваяСтрока.Продукция_Элемент.ВидПродукции;
			НоваяСтрока.НаименованиеПродукции =  НоваяСтрока.Продукция_Элемент.Наименование;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Продукция_Элемент.ЕдиницаИзмерения;	
			НоваяСтрока.НомерПартии = ВетИС_ПроизводствоСервер.ПолучитьНомерПартии(ПараметрыОрганизации, ТекСтрокаТовары);
			Попытка
				НоваяСтрока.Количество = ВетИС_ЗаполнениеДокументовСервер.РассчитатьКоличествоДляВСД(ПараметрыОрганизации, ТекСтрокаТовары, НоваяСтрока.Продукция_Элемент);
			Исключение
				Сообщить(ОписаниеОшибки());
				НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			КонецПопытки;
			
			ВСД2_Производство_ЗаполнитьДатыИзготовления( НоваяСтрока, ДанныеЗаполнения.Дата );
			ВетИС_ПроизводствоСервер.ЗаполнитьУровниУпаковкиИМаркировку(НоваяСтрока, ЭтотОбъект, ПараметрыОрганизации);
		КонецЦикла;
		
	Иначе
		//заполняем по ТЧ Товары
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения[ПереопределяемыеПоляЗапроса.НаименованиеТабличнойЧастиТовары] Цикл
			Продукция_Элемент = ВетИС_ЯдроСервер.Продукция_Элемент_ПолучитьПоНоменклатуре( ТекСтрокаТовары.Номенклатура, ДанныеЗаполнения.Контрагент );
			Если ПараметрыОрганизации["ПропускатьПустыеСвойства"] Тогда
				Если НЕ ЗначениеЗаполнено(Продукция_Элемент) Тогда
					Сообщить("Не указано соответствие для "+ТекСтрокаТовары.Номенклатура+" -> в параметрах указано Пропускать");
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока = Продукция.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Продукция_Элемент = Продукция_Элемент;//ВСД.Получить_ВСД_Продукция_Элемент( НоваяСтрока.Номенклатура );
			
			НоваяСтрока.Продукция = НоваяСтрока.Продукция_Элемент.Продукция ;
			НоваяСтрока.ВидПродукции =  НоваяСтрока.Продукция_Элемент.ВидПродукции;
			НоваяСтрока.НаименованиеПродукции =  НоваяСтрока.Продукция_Элемент.Наименование;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Продукция_Элемент.ЕдиницаИзмерения;	
			Попытка	НоваяСтрока.КлючСтроки = ТекСтрокаТовары.ИдентификаторСтроки; Исключение КонецПопытки;
			
			Попытка
				НоваяСтрока.Количество = ВетИС_ЗаполнениеДокументовСервер.РассчитатьКоличествоДляВСД(ПараметрыОрганизации, ТекСтрокаТовары, НоваяСтрока.Продукция_Элемент);
			Исключение
				Сообщить(ОписаниеОшибки());
				НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			КонецПопытки;
			
			Попытка
				НоваяСтрока.Количество1с = ТекСтрокаТовары[ПараметрыОрганизации["НазваниеРеквизитаКоличество"]];
			Исключение
				Сообщить(ОписаниеОшибки());
				НоваяСтрока.Количество1c = ТекСтрокаТовары.Количество;
			КонецПопытки;
			
			ВСД2_Производство_ЗаполнитьДатыИзготовления( НоваяСтрока, ДанныеЗаполнения.Дата );
			ВетИС_ПроизводствоСервер.ЗаполнитьУровниУпаковкиИМаркировку(НоваяСтрока, ЭтотОбъект, ПараметрыОрганизации);
			
		КонецЦикла;
	КонецЕсли		
	
КонецПроцедуры
	
Процедура ЗаполнитьПоТЗ( тзПартии, ВыбДата=Неопределено, ПараметрыОрганизации)	
	
	Если НЕ ЗначениеЗаполнено(ВыбДата) Тогда 
		ВыбДата = ТекущаяДата();
	КонецЕсли;
	
	ПараметрыОрганизации["Отправитель_Площадка"] = Производитель_Площадка;
	
	//Таблица Партий для произвосдтва
	Для Каждого стрПартий Из тзПартии Цикл
		Если НЕ(ЗначениеЗаполнено(стрПартий.Продукция_Элемент)) Тогда
			ВетИС_ЯдроСервер.СообщитьИнфо("В строке партий № "+(тзПартии.Индекс(стрПартий)+1)+"  не указан ВСД_Продукция_Элемент. Пропускаем...");
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стрПартий.Партия) Тогда
			ВетИС_ЯдроСервер.СообщитьИнфо("В строке партий № "+(тзПартии.Индекс(стрПартий)+1)+" указана партия. Пропускаем...");
			Продолжить;
		КонецЕсли;
		Если СтрПартий.КоличествоСписания <= СтрПартий.Количество Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ(ЗначениеЗаполнено(стрПартий.Продукция_Элемент.ЕдиницаИзмерения)) Тогда
			ВетИС_ЯдроСервер.СообщитьИнфо("В строке партий № "+(тзПартии.Индекс(стрПартий)+1)+" у "+СокрЛП(стрПартий.Продукция_Элемент.Наименование)+" не указана Единица измерения. Пропускаем...");
			Продолжить;
		КонецЕсли;
		
		Если НЕ(ЗначениеЗаполнено(стрПартий.Продукция_Элемент.СрокГодности)) Тогда
			ВетИС_ЯдроСервер.СообщитьИнфо("В строке партий № "+(тзПартии.Индекс(стрПартий)+1)+" у "+СокрЛП(стрПартий.Продукция_Элемент.Наименование)+" не указан Срок годности. Пропускаем...");
			Продолжить;
		КонецЕсли;
		// Возможно несколько производителей-площадок  / продумать
		//Если НЕ(стрПартий.Продукция_Элемент.Площадка = ПараметрыОрганизации["Отправитель_Площадка"] )  Тогда
		//	ВетИС_ЯдроСервер.СообщитьИнфо("В строке партий № "+стрПартий.НомерСтроки+" у "+СокрЛП(стрПартий.Продукция_Элемент.Наименование)+" Производителем является "+стрПартий.Продукция_Элемент.Площадка+". Пропускаем...");
		//	Продолжить;
		//КонецЕсли;
		КоличествоНом =  стрПартий.КоличествоСписания - стрПартий.Количество;
		стрПродукция = Продукция.Добавить();	
		стрПродукция.Продукция_Элемент 	= стрПартий.Продукция_Элемент;
		стрПродукция.Количество 		= КоличествоНом + КоличествоНом/100*ПараметрыОрганизации["КоэфПересчетаКоличестваПриПроизводстве"] ;
		стрПродукция.Количество1с 		= стрПартий.Количество1с;
		стрПродукция.ЕдиницаИзмерения 	= стрПродукция.Продукция_Элемент.ЕдиницаИзмерения;
		стрПродукция.Продукция 			= стрПродукция.Продукция_Элемент.Продукция;
		стрПродукция.ВидПродукции 		= стрПродукция.Продукция_Элемент.ВидПродукции;
		стрПродукция.НаименованиеПродукции = стрПродукция.Продукция_Элемент.Наименование;
		стрПродукция.Номенклатура 		= ВетИС_ЯдроСервер.ПолучитьНоменклатуруПоПродукцияЭлемент( стрПартий.Продукция_Элемент, Истина );					
		стрПродукция.НомерПартии 		= ВетИС_ПроизводствоСервер.ПолучитьНомерПартии(ПараметрыОрганизации, стрПродукция);	
		стрПродукция.Скоропортящийся	= стрПродукция.Продукция_Элемент.Скоропортящийся;
		
		ВСД2_Производство_ЗаполнитьДатыИзготовления( стрПродукция, ВыбДата );
        ВетИС_ПроизводствоСервер.ЗаполнитьУровниУпаковкиИМаркировку(стрПродукция, ЭтотОбъект, ПараметрыОрганизации);
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("ВСД2_Производство_ОбработкаЗаполнения");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		ПереопределенныйМодуль.ВСД2_Производство_ОбработкаЗаполнения( ДанныеЗаполнения, СтандартнаяОбработка );
	КонецЕсли;
	
	Если ВетИС_УтилитыКлиентСервер.ЭтоДокументОтгрузка(ДанныеЗаполнения) Или
		 ВетИС_УтилитыКлиентСервер.ЭтоДокументПеремещение(ДанныеЗаполнения) Тогда
		
		ЗаполнитьПоРеализации( ДанныеЗаполнения );
					
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		// заполнение из групповой обработки 
		ПараметрыОрганизации = ДанныеЗаполнения.ПараметрыОрганизации;
		
		ЗаполнитьПоТЗ( ДанныеЗаполнения["тзПартии"], ДанныеЗаполнения["ВыбДата"], ПараметрыОрганизации);
	КонецЕсли;
		
	Попытка
		Если ПараметрыОрганизации["ПарамПроизводствоЗаполнятьПоСправочнику"] Тогда 			
			тзПартии = ВетИС_ПроизводствоСервер.ЗаполнитьТчСписаниеИзСпецификацииНоменклатуры( ПараметрыОрганизации, Продукция.Выгрузить() );
		Иначе
			Сырье = ВетИС_ПроизводствоСервер.ЗаполнитьСырьеИзВСД_Продукция_Элемент( Продукция.Выгрузить() );
			тзПартии = ВетИС_ЯдроСервер.тзПартииСписанияПоТзПродукция_Элемент( ПараметрыОрганизации, Сырье );
		КонецЕсли;
		ПартииСписания.Загрузить( тзПартии );
		Если ЗначениеЗаполнено(тзПартии) Тогда
			ПолучитьВторичнуюПродукциюПриПереработке(ДанныеЗаполнения, тзПартии);	
		КонецЕсли;
	Исключение
		ВетИС_ЯдроСервер.СообщитьИнфо("Не удалось загрузить партии списания");
	КонецПопытки;			

КонецПроцедуры

// Заполним вторичную продукцию если такая имеется при переработке используемого сырья.
Процедура ПолучитьВторичнуюПродукциюПриПереработке(ДанныеЗаполнения, тзПартииСписания) Экспорт
	
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );
	Попытка
		тзВторичнаяПродукция = Новый ТаблицаЗначений;
		тзВторичнаяПродукция.Колонки.Добавить("Продукция_Элемент",новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция_Элемент"));
		тзВторичнаяПродукция.Колонки.Добавить("Количество",новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
		
		тзПартииСписания.Свернуть("Продукция_Элемент", "Количество");
		Для Каждого СтрСырье Из тзПартииСписания Цикл
			ВторичнаяПродукция = СтрСырье.Продукция_Элемент.ВторичнаяПродукцияПриПереработке.Выгрузить();
			Для Каждого СтрВторПродукция Из ВторичнаяПродукция Цикл
				нСтр = тзВторичнаяПродукция.Добавить();
				нСтр.Продукция_Элемент = СтрВторПродукция.Продукция_Элемент;
				нСтр.Количество = СтрСырье.Количество/100*СтрВторПродукция.Коэффициент;
			КонецЦикла;
		КонецЦикла;
		
		тзВторичнаяПродукция.Свернуть("Продукция_Элемент", "Количество");
		Для Каждого стрВторПродукция Из тзВторичнаяПродукция Цикл
			стрПродукция = Продукция.Добавить();	
			стрПродукция.Продукция_Элемент 	= СтрВторПродукция.Продукция_Элемент;
			стрПродукция.Количество 		= стрВторПродукция.Количество;
			стрПродукция.ЕдиницаИзмерения 	= стрПродукция.Продукция_Элемент.ЕдиницаИзмерения;
			стрПродукция.Продукция 			= стрПродукция.Продукция_Элемент.Продукция;
			стрПродукция.ВидПродукции 		= стрПродукция.Продукция_Элемент.ВидПродукции;
			стрПродукция.НаименованиеПродукции = стрПродукция.Продукция_Элемент.Наименование;
			стрПродукция.Номенклатура 		= ВетИС_ЯдроСервер.ПолучитьНоменклатуруПоПродукцияЭлемент(стрПродукция.Продукция_Элемент, Истина );					
			стрПродукция.НомерПартии 		= ВетИС_ПроизводствоСервер.ПолучитьНомерПартии(ПараметрыОрганизации, стрПродукция);	
			ВыбДата = ДанныеЗаполнения["ВыбДата"];
			Если НЕ ЗначениеЗаполнено(ВыбДата) Тогда 
				ВыбДата = ТекущаяДата();
			КонецЕсли;
			// Если биоотходы: Некачественный = ИСТИНА;
			// ДатаСрокГодности не заполняется;	
			Если стрПродукция.Продукция.GUID = "ae1a8750-3faf-4d93-b2d9-1f2111486d34" Тогда 
				стрПродукция.ДатаИзготовления1 = ВыбДата;
				стрПродукция.Некачественный = Истина;
			Иначе
				ВСД2_Производство_ЗаполнитьДатыИзготовления( стрПродукция, ВыбДата );
			КонецЕсли;
			ВетИС_ПроизводствоСервер.ЗаполнитьУровниУпаковкиИМаркировку(стрПродукция, ЭтотОбъект, ПараметрыОрганизации);
			
		КонецЦикла;
	Исключение
		ВетИС_ЯдроСервер.СообщитьИнфо("Не удалось заполнить вторичную продукцию при переработке сырья");
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
   	КонецЕсли;
	
	Если ОтправкаПоРасписанию Тогда
		Если ЗначениеЗаполнено(ДатаОтправки) Тогда
			Если Не ЗавершитьОперацию Тогда // контроль что отправка раньше чем запланировано завершение производства
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВСД2_Производство.Ссылка КАК ДокПроизводство
				|ИЗ
				|	Документ.ВСД2_Производство КАК ВСД2_Производство
				|ГДЕ
				|	ВСД2_Производство.operationId ПОДОБНО &operationId
				|	И ВСД2_Производство.Ссылка <> &Ссылка
				|	И НЕ ВСД2_Производство.ПометкаУдаления
				|	И ВЫБОР
				|			КОГДА ВСД2_Производство.ЗавершениеПоРасписанию
				|				ТОГДА ВСД2_Производство.ДатаЗавершения < &ДатаОтправки
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ
				|	И НЕ ВСД2_Производство.ЗавершитьОперацию";
				Запрос.УстановитьПараметр("operationId", operationId);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.УстановитьПараметр("ДатаОтправки", ДатаОтправки);
				Результат = Запрос.Выполнить();
				Если Не Результат.Пустой() Тогда
					Выборка = Результат.Выбрать();
					Пока Выборка.Следующий() Цикл
						ВетИС_ЯдроСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("В документе: %1 запланировано завершение производственной транзакции с номером %2 раньше даты отправки текущего документа", Выборка.ДокПроизводство, operationId),
						Выборка.ДокПроизводство,,Выборка.ДокПроизводство, Отказ);	
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВетИС_ЯдроСервер.СообщитьПользователю("Заполните дату отправки документа",,,,Отказ);		
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗавершениеПоРасписанию Тогда
		
		Если Не ЗначениеЗаполнено(ДатаЗавершения) Тогда
			ВетИС_ЯдроСервер.СообщитьПользователю("Не указана дата завершения производства",,,,Отказ);		
		КонецЕсли;
		
		Если ОтправкаПоРасписанию И ДатаОтправки>ДатаЗавершения Тогда
			ВетИС_ЯдроСервер.СообщитьПользователю("Дата отправки не может быть позднее даты завершения",,,,Отказ);		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(operationId) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВСД2_Производство.Ссылка КАК ДокПроизводство
			|ИЗ
			|	Документ.ВСД2_Производство КАК ВСД2_Производство
			|ГДЕ
			|	ВСД2_Производство.ЗавершениеПоРасписанию
			|	И НЕ ВСД2_Производство.ЗавершитьОперацию
			|	И ВСД2_Производство.operationId ПОДОБНО &operationId
			|	И НЕ ВСД2_Производство.ПометкаУдаления
			|	И ВСД2_Производство.Ссылка <> &Ссылка";
			Запрос.УстановитьПараметр("operationId", operationId);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					ВетИС_ЯдроСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Уже запланировано завершение производственной транзакция с номером %1 документ: %2", operationId, Выборка.ДокПроизводство),
												  Выборка.ДокПроизводство,,Выборка.ДокПроизводство,Отказ);	
				КонецЦикла;
			КонецЕсли;
		Иначе
			ВетИС_ЯдроСервер.СообщитьПользователю("Заполните номер незавершенного производства",,,,Отказ);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// LLM_NOTE: ОбработкаПроведения записывает движения в регистры кб_НезавершенныеПроизводственныеТранзакции
// и кб99_ОстаткиПартийВСД. Порядок записи критичен — сначала незавершённые транзакции, потом остатки партий.
// НЕ переставлять блоки и не объединять запросы.
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВСД2_ПроизводствоПродукция.Продукция_Элемент КАК Продукция_Элемент,
		|	СУММА(ВСД2_ПроизводствоПродукция.Количество) КАК КоличествоДвижения
		|ИЗ
		|	Документ.ВСД2_Производство.Продукция КАК ВСД2_ПроизводствоПродукция
		|ГДЕ
		|	ВСД2_ПроизводствоПродукция.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВСД2_ПроизводствоПродукция.Продукция_Элемент";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движения.кб_НезавершенныеПроизводственныеТранзакции.Записывать = Истина; 
		Движение = Движения.кб_НезавершенныеПроизводственныеТранзакции.Добавить();	
	    Движение.Период = Дата;
	    Движение.Площадка = Производитель_Площадка;
	    Движение.ПродукцияЭлемент = ВыборкаДетальныеЗаписи.Продукция_Элемент;		
		Движение.НомерОперацииНезавершенногоПроизводства = Ссылка.operationId;
		Движение.ТранзакцияОткрыта = НЕ Ссылка.ЗавершитьОперацию;
		Движение.ДатаПроизводства = Дата;
		Движение.Организация = Организация;
		
	КонецЦикла;
	
	
	
	Если ВетИС_ГашениеСервер.ФормироватьДвиженияПартий(Организация) Тогда
		
		Движения.кб99_ОстаткиПартийВСД.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВСД2_ПроизводствоПродукция.Продукция_Элемент КАК Продукция_Элемент,
			|	СУММА(ВСД2_ПроизводствоПродукция.Количество) КАК КоличествоДвижения
			|ИЗ
			|	Документ.ВСД2_Производство.Продукция КАК ВСД2_ПроизводствоПродукция
			|ГДЕ
			|	ВСД2_ПроизводствоПродукция.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ВСД2_ПроизводствоПродукция.Продукция_Элемент
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВСД2_ПроизводствоПартииСписания.Продукция_Элемент,
			|	СУММА(-ВСД2_ПроизводствоПартииСписания.Количество)
			|ИЗ
			|	Документ.ВСД2_Производство.ПартииСписания КАК ВСД2_ПроизводствоПартииСписания
			|ГДЕ
			|	ВСД2_ПроизводствоПартииСписания.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ВСД2_ПроизводствоПартииСписания.Продукция_Элемент";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.кб99_ОстаткиПартийВСД.Добавить();
			
			Если ВыборкаДетальныеЗаписи.КоличествоДвижения > 0 Тогда
				КоличествоДвижения = ВыборкаДетальныеЗаписи.КоличествоДвижения;
				ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				КоличествоДвижения = -ВыборкаДетальныеЗаписи.КоличествоДвижения;
				ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;
			
			Движение.ВидДвижения = ВидДвижения;
			Движение.Период = Дата;
			Движение.ВСД_Площадка = Производитель_Площадка;
			Движение.Продукция_Элемент = ВыборкаДетальныеЗаписи.Продукция_Элемент;
			Движение.Количество = КоличествоДвижения
			
		КонецЦикла;
	    
	КонецЕсли;
	
КонецПроцедуры

мНеОткрыватьФормуДокумента = Ложь;
// GRACE:MODULE_END name="ПроизводствоВСД"
